app/Repositories/UserRepository.php

    public function all()
    {
        return User::all();
---
select * from `users`

    public function find($id)
    {
        return User::findOrFail($id);
---
select * from `users` where `users`.`id` = '2' limit 1

    public function create(array $data)
    {
        return User::create($data);
---
insert into `users` (`name`, `email`, `password`, `cellphone`, `address`, `national_code`, `updated_at`, `created_at`) values ('mehdi', 'mehdialibakhshi03@gmail.com', '$2y$12$V/6eRSAVKhbdbntc/KLDBeEPuZ8MQpoWA8qhWDWgR/DXzrkv/jKhm', '09126547064', 'trtrt', '0250055163', '2024-11-26 16:43:01', '2024-11-26 16:43:01')

    public function update($id, array $data)
    {
        $user = $this->find($id);
        $user->update($data);
---
update `users` set `national_code` = '0250055163', `users`.`updated_at` = '2024-11-26 16:48:49' where `id` = 2

    public function delete($id)
    {
        $user = $this->find($id);
        $user->delete();
---
delete from `users` where `id` = 2